### Практические задания по языку программирования C#

#### Задание 1: Переменные и типы данных
**Описание:**  
Создайте программу, которая объявляет переменные различных типов данных (int, double, char, string, bool), присваивает им значения и выводит их на экран.

**Пример:**
```csharp
using System;

class Program
{
    static void Main()
    {
        int age = 25;
        double height = 175.5;
        char gender = 'M';
        string name = "John Doe";
        bool isStudent = true;

        Console.WriteLine($"Name: {name}");
        Console.WriteLine($"Age: {age}");
        Console.WriteLine($"Height: {height}");
        Console.WriteLine($"Gender: {gender}");
        Console.WriteLine($"Is Student: {isStudent}");
    }
}
```

---

#### Задание 2: Константы и литералы
**Описание:**  
Создайте программу, которая использует константы и литералы для вычисления площади круга. Радиус круга должен быть задан как константа.

**Пример:**
```csharp
using System;

class Program
{
    const double PI = 3.14159;
    const double radius = 5.0;

    static void Main()
    {
        #Напиши свое решение здесь
        Console.WriteLine($"Area of the circle: {area}");
    }
}
```

---

#### Задание 3: Консольный ввод-вывод
**Описание:**  
Напишите программу, которая запрашивает у пользователя его имя, возраст и любимый цвет, а затем выводит эту информацию в отформатированном виде.

**Пример:**
```csharp
using System;

class Program
{
    static void Main()
    {
        #Напиши свое решение здесь

        Console.WriteLine($"Hello, {name}! You are {age} years old and your favorite color is {color}.");
    }
}
```

---

#### Задание 4: Работа с литералами и типами данных
**Описание:**  
Напишите программу, которая демонстрирует использование различных литералов (целочисленных, вещественных, символьных, строковых) и выводит их типы данных.

**Пример:**
```csharp
using System;

class Program
{
    static void Main()
    {
        int intLiteral = 42;
        double doubleLiteral = 3.14;
        char charLiteral = 'A';
        string stringLiteral = "Hello, World!";
        bool boolLiteral = true;

        #Напиши свое решение здесь
    }
}
```

---
